{"config": [{"config": {"kernel_constraint": null, "activation": "relu", "dtype": "float32", "batch_input_shape": [null, 1000], "bias_constraint": null, "trainable": true, "units": 100, "use_bias": true, "activity_regularizer": null, "name": "dense_1", "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"kernel_constraint": null, "activation": "relu", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "units": 50, "kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "trainable": true, "name": "dense_2"}, "class_name": "Dense"}, {"config": {"kernel_constraint": null, "activation": "relu", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "units": 1, "kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "trainable": true, "name": "dense_3"}, "class_name": "Dense"}], "keras_version": "2.2.0", "backend": "tensorflow", "class_name": "Sequential"}